milesotne 07/Write Your First Load Test/load-test.yml
# Artillery load test — Movie Quote API
# Simulates load ramping to 50 virtual users over 30 seconds

config:
  target: "http://localhost:3001"
  phases:
    - duration: 30
      arrivalRate: 50
      rampTo: 50
      name: "Ramp up to 50 users"
  ensure:
    - statusCode: 200

scenarios:
  - name: "Get all quotes (unpaginated)"
    flow:
      - get:
          url: "/api/quotes/unpaginated"

  - name: "Get paginated quotes (page 1, limit 20)"
    flow:
      - get:
          url: "/api/quotes?page=1&limit=20"

  - name: "Add to favorites"
    flow:
      - post:
          url: "/api/favorites"
          json:
            quoteId: 1